// ১-১০০ পর্যন্ত কোন সংখ্যাগুলো ৩,৫ এবং ৩,৫ উভয় সংখ্যা দ্বারা বিভাজ্য তা বের করুন। 

// ১ এবং ঐ সংখ্যা ছাড়া অন্য সংখ্যা দ্বারা ভাগ করা যায়না সেগুলো হচ্ছে মৌলিক সংখ্যা
// সবছেয়ে ছোট মৌলিক সংখ্যা হচ্ছে ২
// ৩ এবং ৫ হচ্ছে মৌলিক সংখ্যা এবং এদের ল.সা.গু হচ্ছে ১৫ 

function fizzBuzz(number) {
  for(let i = 0; i <= number; i++ ) {
    if(i % 15 === 0) { // কারন ৩ এবং ৫ এর ল.সা.গু হচ্ছে ১৫
      console.log(`${i} is FizzBuzz`);
    } else if(i % 3 === 0) {
      console.log(`${i} is Fizz`);
    } else if(i % 5 === 0) {
      console.log(`${i} is Buzz`);
    }
  }
}

fizzBuzz(100);